{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with Richard E. Grant and professional in the alter ego of the series, that is a comics character, of The Shadow (video game)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> ?v1 . ?v2 <http://dbpedia.org/property/starring> ?result . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v0 <http://dbpedia.org/property/alterEgo> ?v1 . ?v2 <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Richard_E._Grant> . <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the profession of the actor, that is a politician, of Ab Kya Hoga and professional in the alter ego of The Shadow."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/property/occupation> ?v4 . <http://dbpedia.org/resource/Ab_Kya_Hoga> <http://dbpedia.org/ontology/starring> ?v0 . ?result <http://dbpedia.org/property/occupation> ?v3 . ?result <http://dbpedia.org/property/occupation> ?v4 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/The_Shadow> <http://dbpedia.org/property/alterEgo> ?v3 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the profession of Shatrughan Sinha and professional in the alter ego of the series, that is a comics character, of The Shadow (video game)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Shatrughan_Sinha> <http://dbpedia.org/property/occupation> ?v4 . ?result <http://dbpedia.org/property/occupation> ?v4 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. ?result <http://dbpedia.org/property/occupation> ?v2 . ?v1 <http://dbpedia.org/property/alterEgo> ?v2 . <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with the person born as Richard Grant Esterhuysen and professional in the profession of Shatrughan Sinha and professional in ."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Shatrughan_Sinha> <http://dbpedia.org/property/occupation> ?v5 . ?result <http://dbpedia.org/property/occupation> \"\"@en . ?result <http://dbpedia.org/property/occupation> ?v5 . ?v2 <http://dbpedia.org/property/starring> ?v3 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v3 <http://dbpedia.org/property/birthName> \"Richard Grant Esterhuysen\"@en . ?v2 <http://dbpedia.org/property/starring> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with the person born as Richard Grant Esterhuysen and professional in the alter ego of The Shadow and professional in Actor."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/The_Shadow> <http://dbpedia.org/property/alterEgo> ?v1 . ?v2 <http://dbpedia.org/property/starring> ?result . ?result <http://dbpedia.org/property/occupation> \"Actor\"@en . ?v2 <http://dbpedia.org/property/starring> ?v3 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?result <http://dbpedia.org/property/occupation> ?v1 . ?v3 <http://dbpedia.org/property/birthName> \"Richard Grant Esterhuysen\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with Richard E. Grant and professional in  and professional in the profession of the actor, that is a politician, of Ab Kya Hoga."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v3 <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Richard_E._Grant> . ?v0 <http://dbpedia.org/property/occupation> ?v5 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v3 <http://dbpedia.org/property/starring> ?result . <http://dbpedia.org/resource/Ab_Kya_Hoga> <http://dbpedia.org/ontology/starring> ?v0 . ?result <http://dbpedia.org/property/occupation> ?v5 . ?result <http://dbpedia.org/property/occupation> \"\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the alter ego of The Shadow and actor of the movie, that is a television show, with Richard E. Grant and professional in the profession of Shatrughan Sinha."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Shatrughan_Sinha> <http://dbpedia.org/property/occupation> ?v5 . ?result <http://dbpedia.org/property/occupation> ?v5 . <http://dbpedia.org/resource/The_Shadow> <http://dbpedia.org/property/alterEgo> ?v2 . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?result <http://dbpedia.org/property/occupation> ?v2 . ?v3 <http://dbpedia.org/property/starring> ?result . ?v3 <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Richard_E._Grant> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with Richard E. Grant and professional in the alter ego of the series, that is a comics character, of The Shadow (video game) and professional in Actor."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> \"Actor\"@en . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v0 . ?v2 <http://dbpedia.org/property/starring> <http://dbpedia.org/resource/Richard_E._Grant> . ?v2 <http://dbpedia.org/property/starring> ?result . ?result <http://dbpedia.org/property/occupation> ?v1 . ?v0 <http://dbpedia.org/property/alterEgo> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the alter ego of The Shadow and professional in the profession of the actor, that is a politician, of Ab Kya Hoga and actor of Dispatches from Elsewhere."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/property/occupation> ?v5 . ?result <http://dbpedia.org/property/occupation> ?v5 . <http://dbpedia.org/resource/The_Shadow> <http://dbpedia.org/property/alterEgo> ?v3 . ?result <http://dbpedia.org/property/occupation> ?v3 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/Dispatches_from_Elsewhere> <http://dbpedia.org/property/starring> ?result . <http://dbpedia.org/resource/Ab_Kya_Hoga> <http://dbpedia.org/ontology/starring> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the profession of Shatrughan Sinha and professional in the alter ego of the series, that is a comics character, of The Shadow (video game) and actor of Dispatches from Elsewhere."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Dispatches_from_Elsewhere> <http://dbpedia.org/property/starring> ?result . ?v1 <http://dbpedia.org/property/alterEgo> ?v2 . ?result <http://dbpedia.org/property/occupation> ?v2 . <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. ?result <http://dbpedia.org/property/occupation> ?v5 . <http://dbpedia.org/resource/Shatrughan_Sinha> <http://dbpedia.org/property/occupation> ?v5 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a television show, with the person born as Richard Grant Esterhuysen and professional in the profession of the actor, that is a politician, of Ab Kya Hoga."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v3 <http://dbpedia.org/property/birthName> \"Richard Grant Esterhuysen\"@en . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v2 <http://dbpedia.org/property/starring> ?result . ?result <http://dbpedia.org/property/occupation> ?v5 . ?v0 <http://dbpedia.org/property/occupation> ?v5 . ?v2 <http://dbpedia.org/property/starring> ?v3 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/Ab_Kya_Hoga> <http://dbpedia.org/ontology/starring> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the alter ego of the series, that is a comics character, of The Shadow (video game) and actor of the movie, that is a television show, with the person born as Richard Grant Esterhuysen."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> ?v1 . ?v2 <http://dbpedia.org/property/starring> ?v3 . ?v0 <http://dbpedia.org/property/alterEgo> ?v1 . ?v2 <http://dbpedia.org/property/starring> ?result . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow>. ?v3 <http://dbpedia.org/property/birthName> \"Richard Grant Esterhuysen\"@en . <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the alter ego of the series, that is a comics character, of The Shadow (video game) and professional in the profession of the actor, that is a politician, of Ab Kya Hoga."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?result <http://dbpedia.org/property/occupation> ?v3 . ?v1 <http://dbpedia.org/property/alterEgo> ?v3 . <http://dbpedia.org/resource/Ab_Kya_Hoga> <http://dbpedia.org/ontology/starring> ?v0 . <http://dbpedia.org/resource/The_Shadow_(video_game)> <http://dbpedia.org/ontology/series> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ComicsCharacter>. ?result <http://dbpedia.org/property/occupation> ?v5 . ?v0 <http://dbpedia.org/property/occupation> ?v5 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Minye Kyawswa."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Minye_Kyawswa> <http://dbpedia.org/ontology/child> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the parent of Min Hla Htut of Pyakaung."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child, that is a royalty, of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father, that is a royalty, of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse, that is a royalty, of Saw Min Phyu."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Min_Phyu> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla and spouse of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla and predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of the parent of Min Hla Htut of Pyakaung."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/parent> ?v0 . ?v0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of Saw Shwe Khet and predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of the father, that is a royalty, of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?v1 . ?result <http://dbpedia.org/ontology/spouse> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the child of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?result <http://dbpedia.org/ontology/successor> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the parent of the child of Minye Kyawswa."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/child> ?v1 . <http://dbpedia.org/resource/Minye_Kyawswa> <http://dbpedia.org/ontology/child> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father, that is a royalty, of the child, that is a royalty, of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?v1 <http://dbpedia.org/property/father> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of the spouse, that is a royalty, of Saw Min Phyu."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/father> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?v1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Min_Phyu> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla and spouse of Saw Shwe Khet and predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of Saw Shwe Khet and child of the parent of Min Hla Htut of Pyakaung."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?result <http://dbpedia.org/ontology/parent> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla and spouse of the father, that is a royalty, of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?v2 . ?result <http://dbpedia.org/ontology/spouse> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of the parent of Min Hla Htut of Pyakaung and predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?result <http://dbpedia.org/ontology/parent> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the child of Saw Shwe Khet and child of Saw Min Hla."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . ?result <http://dbpedia.org/ontology/successor> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of the parent of the child of Minye Kyawswa."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/child> ?v2 . ?result <http://dbpedia.org/ontology/parent> ?v0 . <http://dbpedia.org/resource/Minye_Kyawswa> <http://dbpedia.org/ontology/child> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of Myat Hpone Pyo and spouse of the father, that is a royalty, of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?v2 . ?result <http://dbpedia.org/ontology/spouse> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the child of Saw Shwe Khet and spouse of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?result <http://dbpedia.org/ontology/successor> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the child of the spouse, that is a royalty, of Saw Min Phyu."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> ?v2 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?v1 <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Min_Phyu> . ?v2 <http://dbpedia.org/property/father> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of Saw Shwe Khet and child of the parent of Min Hla Htut of Pyakaung and predecessor of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/parent> ?v1 . ?v1 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of Myat Hpone Pyo and child of Saw Min Hla and spouse of the father, that is a royalty, of Myat Hpone Pyo."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?v3 . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/ontology/spouse> ?v3 . ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of Saw Shwe Khet and child of the parent of the child of Minye Kyawswa."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/child> ?v1 . ?result <http://dbpedia.org/ontology/parent> ?v0 . <http://dbpedia.org/resource/Minye_Kyawswa> <http://dbpedia.org/ontology/child> ?v1 . ?result <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Saw_Shwe_Khet> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the spouse of the father, that is a royalty, of Myat Hpone Pyo and child of the parent of Min Hla Htut of Pyakaung."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/child> <http://dbpedia.org/resource/Min_Hla_Htut_of_Pyakaung> . ?result <http://dbpedia.org/ontology/parent> ?v1 . <http://dbpedia.org/resource/Myat_Hpone_Pyo> <http://dbpedia.org/property/father> ?v3 . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/ontology/spouse> ?v3 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Saw Min Hla and spouse of the father, that is a royalty, of the child, that is a royalty, of Saw Shwe Khet."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/spouse> ?v3 . ?v0 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Saw_Shwe_Khet> . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?result <http://dbpedia.org/ontology/parent> <http://dbpedia.org/resource/Saw_Min_Hla> . ?v0 <http://dbpedia.org/property/father> ?v3 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of Myat Hpone Pyo and child of the parent of the child of Minye Kyawswa."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Myat_Hpone_Pyo> . <http://dbpedia.org/resource/Minye_Kyawswa> <http://dbpedia.org/ontology/child> ?v2 . ?v1 <http://dbpedia.org/ontology/child> ?v2 . ?result <http://dbpedia.org/ontology/parent> ?v1 . }"}]}
