{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the person born as David Declan Costello?"}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/birthName> \"David Declan Costello\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the work, that is an office holder, of yes?"}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?result <http://dbpedia.org/property/author> \"yes\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Declan Costello and party of Mark Durkan."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Mark_Durkan> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Declan_Costello> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Enda Kenny and party of Mark Durkan."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Enda_Kenny> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Mark_Durkan> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the leader, that is a politician and an office holder, of 2005 Castlereagh Borough Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/2005_Castlereagh_Borough_Council_election> <http://dbpedia.org/property/leader> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Declan Costello and party of Enda Kenny."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Enda_Kenny> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Declan_Costello> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born as David Declan Costello."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/party> ?result . ?v1 <http://dbpedia.org/property/birthName> \"David Declan Costello\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the work, that is an office holder, of yes."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v1 <http://dbpedia.org/property/author> \"yes\"@en . ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Enda Kenny and party of Declan Costello and party of Mark Durkan."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Enda_Kenny> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Mark_Durkan> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Declan_Costello> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Declan Costello and party of the leader, that is a politician and an office holder, of 2005 Castlereagh Borough Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/party> ?result . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. <http://dbpedia.org/resource/Declan_Costello> <http://dbpedia.org/ontology/party> ?result . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/2005_Castlereagh_Borough_Council_election> <http://dbpedia.org/property/leader> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born as David Declan Costello and party of Mark Durkan."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/ontology/party> ?result . ?v2 <http://dbpedia.org/property/birthName> \"David Declan Costello\"@en . <http://dbpedia.org/resource/Mark_Durkan> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Enda Kenny and party of the leader, that is a politician and an office holder, of 2005 Castlereagh Borough Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Enda_Kenny> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/2005_Castlereagh_Borough_Council_election> <http://dbpedia.org/property/leader> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the work, that is an office holder, of yes and party of Mark Durkan."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v0 <http://dbpedia.org/property/author> \"yes\"@en . ?v0 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Mark_Durkan> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born as David Declan Costello and party of Enda Kenny."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Enda_Kenny> <http://dbpedia.org/ontology/party> ?result . ?v2 <http://dbpedia.org/property/birthName> \"David Declan Costello\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the work, that is an office holder, of yes and party of Declan Costello."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/author> \"yes\"@en . <http://dbpedia.org/resource/Declan_Costello> <http://dbpedia.org/ontology/party> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of EarthGang."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of Saba (rapper)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the mayor of 1999 West Dunbartonshire Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/1999_West_Dunbartonshire_Council_election> <http://dbpedia.org/property/leader> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor, that is an organisation, of Dreamville Presents: Revenge."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. <http://dbpedia.org/resource/Dreamville_Presents:_Revenge> <http://dbpedia.org/property/starring> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the person born as Tahj Malik Chandler."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/birthName> \"Tahj Malik Chandler\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in  and associated musical artist of EarthGang."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> \"\"@en . <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of Saba (rapper) and professional in ."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?result <http://dbpedia.org/property/occupation> \"\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the mayor of 1999 West Dunbartonshire Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> ?v1 . <http://dbpedia.org/resource/1999_West_Dunbartonshire_Council_election> <http://dbpedia.org/property/leader> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of EarthGang and associated musical artist of Saba (rapper)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the actor, that is an organisation, of Dreamville Presents: Revenge."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. <http://dbpedia.org/resource/Dreamville_Presents:_Revenge> <http://dbpedia.org/property/starring> ?v1 . ?v1 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the person born as Tahj Malik Chandler."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?v1 <http://dbpedia.org/property/birthName> \"Tahj Malik Chandler\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of Saba (rapper) and associated musical artist of EarthGang and professional in ."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?result <http://dbpedia.org/property/occupation> \"\"@en . <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of EarthGang and professional in the mayor of 1999 West Dunbartonshire Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/1999_West_Dunbartonshire_Council_election> <http://dbpedia.org/property/leader> ?v1 . ?result <http://dbpedia.org/property/occupation> ?v1 . <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the actor, that is an organisation, of Dreamville Presents: Revenge and professional in ."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. ?result <http://dbpedia.org/property/occupation> \"\"@en . ?v2 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . <http://dbpedia.org/resource/Dreamville_Presents:_Revenge> <http://dbpedia.org/property/starring> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of Saba (rapper) and professional in the mayor of 1999 West Dunbartonshire Council election."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . <http://dbpedia.org/resource/1999_West_Dunbartonshire_Council_election> <http://dbpedia.org/property/leader> ?v1 . ?result <http://dbpedia.org/property/occupation> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the person born as Tahj Malik Chandler and professional in ."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?v2 <http://dbpedia.org/property/birthName> \"Tahj Malik Chandler\"@en . ?result <http://dbpedia.org/property/occupation> \"\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the actor, that is an organisation, of Dreamville Presents: Revenge and associated musical artist of Saba (rapper)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . <http://dbpedia.org/resource/Dreamville_Presents:_Revenge> <http://dbpedia.org/property/starring> ?v1 . <http://dbpedia.org/resource/Saba_(rapper)> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the associated musical artist of the person born as Tahj Malik Chandler and associated musical artist of EarthGang."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/EarthGang> <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?v2 <http://dbpedia.org/ontology/associatedMusicalArtist> ?result . ?v2 <http://dbpedia.org/property/birthName> \"Tahj Malik Chandler\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of Eric Cross (writer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Eric_Cross_(writer)> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Northern Ireland."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Northern_Ireland> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the author of The Tailor and Ansty."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/The_Tailor_and_Ansty> <http://dbpedia.org/property/author> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the region, that is a country, of Western European Time."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?result <http://dbpedia.org/property/timeZone> <http://dbpedia.org/resource/Western_European_Time> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace, that is an organisation and a country, of Robert Bates (loyalist)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. <http://dbpedia.org/resource/Robert_Bates_(loyalist)> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in United Kingdom and birthplace of Eric Cross (writer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Eric_Cross_(writer)> <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of Eric Cross (writer) and entity in Northern Ireland."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Eric_Cross_(writer)> <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Northern_Ireland> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of the author of The Tailor and Ansty."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/birthPlace> ?result . <http://dbpedia.org/resource/The_Tailor_and_Ansty> <http://dbpedia.org/property/author> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in United Kingdom and entity in Northern Ireland."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom> . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Northern_Ireland> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the region, that is a country, of Western European Time."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?result <http://dbpedia.org/ontology/country> ?v1 . ?v1 <http://dbpedia.org/property/timeZone> <http://dbpedia.org/resource/Western_European_Time> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birthplace, that is an organisation and a country, of Robert Bates (loyalist)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. <http://dbpedia.org/resource/Robert_Bates_(loyalist)> <http://dbpedia.org/ontology/birthPlace> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in United Kingdom and birthplace of the author of The Tailor and Ansty."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom> . <http://dbpedia.org/resource/The_Tailor_and_Ansty> <http://dbpedia.org/property/author> ?v1 . ?v1 <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the region, that is a country, of Western European Time and birthplace of Eric Cross (writer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v2 . ?v2 <http://dbpedia.org/property/timeZone> <http://dbpedia.org/resource/Western_European_Time> . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. <http://dbpedia.org/resource/Eric_Cross_(writer)> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Northern Ireland and birthplace of the author of The Tailor and Ansty."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Northern_Ireland> . <http://dbpedia.org/resource/The_Tailor_and_Ansty> <http://dbpedia.org/property/author> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of Eric Cross (writer) and entity in the birthplace, that is an organisation and a country, of Robert Bates (loyalist)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. ?result <http://dbpedia.org/ontology/country> ?v2 . <http://dbpedia.org/resource/Eric_Cross_(writer)> <http://dbpedia.org/ontology/birthPlace> ?result . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. <http://dbpedia.org/resource/Robert_Bates_(loyalist)> <http://dbpedia.org/ontology/birthPlace> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Northern Ireland and entity in the region, that is a country, of Western European Time."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Northern_Ireland> . ?v1 <http://dbpedia.org/property/timeZone> <http://dbpedia.org/resource/Western_European_Time> . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?result <http://dbpedia.org/ontology/country> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in United Kingdom and entity in the birthplace, that is an organisation and a country, of Robert Bates (loyalist)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation>. ?result <http://dbpedia.org/ontology/country> ?v2 . <http://dbpedia.org/resource/Robert_Bates_(loyalist)> <http://dbpedia.org/ontology/birthPlace> ?v2 . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom> . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the governor of Oklahoma."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Oklahoma> <http://dbpedia.org/property/governor> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the governor of Dana Murphy."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Dana_Murphy> <http://dbpedia.org/property/governor> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the person born as John Kevin Stitt."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/birthName> \"John Kevin Stitt\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the death place, that is a settlement, of Cliff Roquemore."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Cliff_Roquemore> <http://dbpedia.org/ontology/deathPlace> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. }"}]}
