{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birth place, that is a settlement, of Mark Tournier."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Mark_Tournier> <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the person decedent at Melbourne and predecessor of Ada Watson."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Ada_Watson> . ?result <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Melbourne> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the person born, that is a politician, as Ada Jane Low."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/successor> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v0 <http://dbpedia.org/property/birthName> \"Ada Jane Low\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the person decedent at the birth place, that is a settlement, of Mark Tournier."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Mark_Tournier> <http://dbpedia.org/ontology/birthPlace> ?v0 . ?result <http://dbpedia.org/ontology/deathPlace> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of the person born, that is a politician, as Ada Jane Low and person decedent at Melbourne."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v0 <http://dbpedia.org/property/birthName> \"Ada Jane Low\"@en . ?result <http://dbpedia.org/ontology/successor> ?v0 . ?result <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Melbourne> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the predecessor of Ada Watson and person decedent at the birth place, that is a settlement, of Mark Tournier."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Mark_Tournier> <http://dbpedia.org/ontology/birthPlace> ?v2 . ?result <http://dbpedia.org/ontology/successor> <http://dbpedia.org/resource/Ada_Watson> . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. ?result <http://dbpedia.org/ontology/deathPlace> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of Jamshedpur."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Jamshedpur> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of India."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/India> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the work, that is Indian, of Jamsetji Tata."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/India>. ?result <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Jamsetji_Tata> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace, that is a country, of Shobhna Samarth."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Shobhna_Samarth> <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of Jamshedpur and native of India."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/India> . ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Jamshedpur> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of the work, that is Indian, of Jamsetji Tata."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> ?v0 . ?v0 <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Jamsetji_Tata> . ?v0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/India>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of the birthplace, that is a country, of Shobhna Samarth."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> ?v0 . <http://dbpedia.org/resource/Shobhna_Samarth> <http://dbpedia.org/ontology/birthPlace> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of India and native of the work, that is Indian, of Jamsetji Tata."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/India>. ?result <http://dbpedia.org/ontology/birthPlace> ?v0 . ?v0 <http://dbpedia.org/property/author> <http://dbpedia.org/resource/Jamsetji_Tata> . ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/India> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the native of the birthplace, that is a country, of Shobhna Samarth and native of Jamshedpur."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/birthPlace> ?v2 . <http://dbpedia.org/resource/Shobhna_Samarth> <http://dbpedia.org/ontology/birthPlace> ?v2 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?result <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Jamshedpur> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the band member of Emilia (Bulgarian singer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Emilia_(Bulgarian_singer)> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the person born as Emilia Yancheva Valeva."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/birthName> \"Emilia Yancheva Valeva\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the profession of Jamie T."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Jamie_T> <http://dbpedia.org/property/occupation> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in Singer and band member of Emilia (Bulgarian singer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/occupation> \"Singer\"@en . ?result <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Emilia_(Bulgarian_singer)> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the band member of the person born as Emilia Yancheva Valeva."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/birthName> \"Emilia Yancheva Valeva\"@en . ?result <http://dbpedia.org/ontology/associatedMusicalArtist> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in the profession of Jamie T."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Jamie_T> <http://dbpedia.org/property/occupation> ?v0 . ?result <http://dbpedia.org/property/occupation> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the professional in Singer and band member of the person born as Emilia Yancheva Valeva."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/property/birthName> \"Emilia Yancheva Valeva\"@en . ?result <http://dbpedia.org/ontology/associatedMusicalArtist> ?v2 . ?result <http://dbpedia.org/property/occupation> \"Singer\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the band member of Emilia (Bulgarian singer) and professional in the profession of Jamie T."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Jamie_T> <http://dbpedia.org/property/occupation> ?v0 . ?result <http://dbpedia.org/property/occupation> ?v0 . ?result <http://dbpedia.org/ontology/associatedMusicalArtist> <http://dbpedia.org/resource/Emilia_(Bulgarian_singer)> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in United States."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the institution in Georgia (U.S. state)."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Georgia_(U.S._state)> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birth place, that is a country, of Little Hat Jones."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Little_Hat_Jones> <http://dbpedia.org/ontology/birthPlace> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the administration of Brian Kemp."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Brian_Kemp> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the institution in Georgia (U.S. state) and entity in United States."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Georgia_(U.S._state)> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birth place, that is a country, of Little Hat Jones."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v1 . <http://dbpedia.org/resource/Little_Hat_Jones> <http://dbpedia.org/ontology/birthPlace> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the institution in the administration of Brian Kemp."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/state> ?v1 . ?v1 <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Brian_Kemp> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the institution in Georgia (U.S. state) and entity in the birth place, that is a country, of Little Hat Jones."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v2 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country>. ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Georgia_(U.S._state)> . <http://dbpedia.org/resource/Little_Hat_Jones> <http://dbpedia.org/ontology/birthPlace> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the institution in the administration of Brian Kemp and entity in United States."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . ?v1 <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Brian_Kemp> . ?result <http://dbpedia.org/ontology/state> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Ottoman Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Ottoman_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the reference to Order of the Medjidie."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://xmlns.com/foaf/0.1/name> \"Order of the Medjidie\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of Burhan Belge."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Burhan_Belge> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the award of Charles Parsons (British Army officer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Charles_Parsons_(British_Army_officer)> <http://dbpedia.org/property/awards> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Ottoman Empire and reference to Order of the Medjidie."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://xmlns.com/foaf/0.1/name> \"Order of the Medjidie\"@en . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Ottoman_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birthplace of Burhan Belge."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Burhan_Belge> <http://dbpedia.org/ontology/birthPlace> ?v0 . ?result <http://dbpedia.org/ontology/country> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the reference to the award of Charles Parsons (British Army officer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Charles_Parsons_(British_Army_officer)> <http://dbpedia.org/property/awards> ?v0 . ?result <http://xmlns.com/foaf/0.1/name> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birthplace of Burhan Belge and reference to Order of the Medjidie."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Burhan_Belge> <http://dbpedia.org/ontology/birthPlace> ?v0 . ?result <http://dbpedia.org/ontology/country> ?v0 . ?result <http://xmlns.com/foaf/0.1/name> \"Order of the Medjidie\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Ottoman Empire and reference to the award of Charles Parsons (British Army officer)."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Charles_Parsons_(British_Army_officer)> <http://dbpedia.org/property/awards> ?v2 . ?result <http://xmlns.com/foaf/0.1/name> ?v2 . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Ottoman_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Andhra Pradesh."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Andhra_Pradesh> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the alma mater of Chennupati Jagadish."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Chennupati_Jagadish> <http://dbpedia.org/ontology/almaMater> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birthplace of Yandamuri Veerendranath."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Yandamuri_Veerendranath> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the awardee, that is australian and a scientist, of Australian Laureate Fellowship?"}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>. ?result <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Australia>. ?result <http://dbpedia.org/property/awards> \"Australian Laureate Fellowship\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the alma mater of Chennupati Jagadish and entity in Andhra Pradesh."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Chennupati_Jagadish> <http://dbpedia.org/ontology/almaMater> ?result . ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Andhra_Pradesh> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birthplace of Yandamuri Veerendranath."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Yandamuri_Veerendranath> <http://dbpedia.org/ontology/birthPlace> ?v1 . ?result <http://dbpedia.org/ontology/state> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the alma mater of the awardee, that is australian and a scientist, of Australian Laureate Fellowship."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/almaMater> ?result . ?v0 <http://dbpedia.org/property/awards> \"Australian Laureate Fellowship\"@en . ?v0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Australia>. ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birthplace of Yandamuri Veerendranath and alma mater of Chennupati Jagadish."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Yandamuri_Veerendranath> <http://dbpedia.org/ontology/birthPlace> ?v2 . ?result <http://dbpedia.org/ontology/state> ?v2 . <http://dbpedia.org/resource/Chennupati_Jagadish> <http://dbpedia.org/ontology/almaMater> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the alma mater of the awardee, that is australian and a scientist, of Australian Laureate Fellowship and entity in Andhra Pradesh."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/property/awards> \"Australian Laureate Fellowship\"@en . ?v0 <http://dbpedia.org/ontology/almaMater> ?result . ?result <http://dbpedia.org/ontology/state> <http://dbpedia.org/resource/Andhra_Pradesh> . ?v0 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/Australia>. ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Guillaume Peltier."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Guillaume_Peltier> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Bruno Retailleau."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Bruno_Retailleau> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the successor, that is a politician and French, of Patrice Martin-Lalande."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Patrice_Martin-Lalande> <http://dbpedia.org/ontology/successor> ?result . ?result <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/France>. ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Guillaume Peltier and party of Bruno Retailleau."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Guillaume_Peltier> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Bruno_Retailleau> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the successor, that is a politician and French, of Patrice Martin-Lalande."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/France>. <http://dbpedia.org/resource/Patrice_Martin-Lalande> <http://dbpedia.org/ontology/successor> ?v1 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born, that is an office holder and a politician, as Bruno Daniel Marie Paul Retailleau."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v1 <http://dbpedia.org/property/birthName> \"Bruno Daniel Marie Paul Retailleau\"@en . ?v1 <http://dbpedia.org/ontology/party> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Bruno Retailleau and party of the successor, that is a politician and French, of Patrice Martin-Lalande."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v2 <http://dbpedia.org/ontology/party> ?result . ?v2 <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/France>. <http://dbpedia.org/resource/Bruno_Retailleau> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Patrice_Martin-Lalande> <http://dbpedia.org/ontology/successor> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born, that is an office holder and a politician, as Bruno Daniel Marie Paul Retailleau and party of Guillaume Peltier."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/Guillaume_Peltier> <http://dbpedia.org/ontology/party> ?result . ?v1 <http://dbpedia.org/ontology/party> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/OfficeHolder>. ?v1 <http://dbpedia.org/property/birthName> \"Bruno Daniel Marie Paul Retailleau\"@en . }"}]}
