{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of the parent of Dorothea of Denmark, Electress Palatine and child of Maximilian I, Holy Roman Emperor."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Maximilian_I,_Holy_Roman_Emperor> <http://dbpedia.org/ontology/child> ?result . <http://dbpedia.org/resource/Dorothea_of_Denmark,_Electress_Palatine> <http://dbpedia.org/ontology/parent> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of Isabella of Austria and child of the commander, that is a royalty, in Siege of Padua."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Siege_of_Padua> <http://dbpedia.org/ontology/commander> ?v2 . ?v2 <http://dbpedia.org/ontology/child> ?result . <http://dbpedia.org/resource/Isabella_of_Austria> <http://dbpedia.org/property/father> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of Catherine of Austria, Queen of Portugal and father of the parent of Dorothea of Denmark, Electress Palatine."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Catherine_of_Austria,_Queen_of_Portugal> <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Dorothea_of_Denmark,_Electress_Palatine> <http://dbpedia.org/ontology/parent> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of the child, that is a royalty, of Philip I of Castile and father of Isabella of Austria."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Isabella_of_Austria> <http://dbpedia.org/property/father> ?result . ?v0 <http://dbpedia.org/property/father> ?result . ?v0 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Philip_I_of_Castile> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of Catherine of Austria, Queen of Portugal and child of the commander, that is a royalty, in Siege of Padua."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?v2 <http://dbpedia.org/ontology/child> ?result . <http://dbpedia.org/resource/Siege_of_Padua> <http://dbpedia.org/ontology/commander> ?v2 . <http://dbpedia.org/resource/Catherine_of_Austria,_Queen_of_Portugal> <http://dbpedia.org/property/father> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Maximilian I, Holy Roman Emperor and father of the child, that is a royalty, of Philip I of Castile."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> ?result . ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Philip_I_of_Castile> . <http://dbpedia.org/resource/Maximilian_I,_Holy_Roman_Emperor> <http://dbpedia.org/ontology/child> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of the commander, that is a royalty, in Siege of Padua and father of Catherine of Austria, Queen of Portugal and father of Isabella of Austria."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/child> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Isabella_of_Austria> <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Catherine_of_Austria,_Queen_of_Portugal> <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Siege_of_Padua> <http://dbpedia.org/ontology/commander> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the child of Maximilian I, Holy Roman Emperor and father of Isabella of Austria and father of the child, that is a royalty, of Philip I of Castile."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Philip_I_of_Castile> . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Isabella_of_Austria> <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Maximilian_I,_Holy_Roman_Emperor> <http://dbpedia.org/ontology/child> ?result . ?v1 <http://dbpedia.org/property/father> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of the parent of Dorothea of Denmark, Electress Palatine and child of the commander, that is a royalty, in Siege of Padua."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Siege_of_Padua> <http://dbpedia.org/ontology/commander> ?v0 . ?v3 <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Dorothea_of_Denmark,_Electress_Palatine> <http://dbpedia.org/ontology/parent> ?v3 . ?v0 <http://dbpedia.org/ontology/child> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of the child, that is a royalty, of Philip I of Castile and father of the parent of Dorothea of Denmark, Electress Palatine."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Philip_I_of_Castile> . ?v1 <http://dbpedia.org/property/father> ?result . ?v3 <http://dbpedia.org/property/father> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. <http://dbpedia.org/resource/Dorothea_of_Denmark,_Electress_Palatine> <http://dbpedia.org/ontology/parent> ?v3 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the father of the child, that is a royalty, of Philip I of Castile and child of the commander, that is a royalty, in Siege of Padua."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/father> <http://dbpedia.org/resource/Philip_I_of_Castile> . ?v2 <http://dbpedia.org/ontology/child> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. ?v1 <http://dbpedia.org/property/father> ?result . <http://dbpedia.org/resource/Siege_of_Padua> <http://dbpedia.org/ontology/commander> ?v2 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Royalty>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Napoleon Zervas."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Athens."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Konstantinos Ventiris."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the leader of National Party of Greece?"}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the death place, that is a settlement, of Antonios Varthalitis."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?result . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the awardee of 30?"}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Athens and war of Napoleon Zervas."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Konstantinos Ventiris and war of Napoleon Zervas."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the leader of National Party of Greece."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v1 . ?v1 <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Athens and war of Konstantinos Ventiris."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the death place, that is a settlement, of Antonios Varthalitis."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> ?v0 . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v0 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of 30."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the leader of National Party of Greece and entity in Athens."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Napoleon Zervas and entity in the death place, that is a settlement, of Antonios Varthalitis."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> ?v1 . <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Konstantinos Ventiris and war of the leader of National Party of Greece."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of 30 and war of Napoleon Zervas."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . ?v2 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the death place, that is a settlement, of Antonios Varthalitis and war of Konstantinos Ventiris."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> ?v1 . <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of 30 and entity in Athens."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . ?v0 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Konstantinos Ventiris and war of the leader of National Party of Greece and entity in Athens."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . ?v1 <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the death place, that is a settlement, of Antonios Varthalitis and war of Napoleon Zervas and war of Konstantinos Ventiris."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Konstantinos_Ventiris> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> ?v3 . <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v3 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Napoleon Zervas and war of the awardee of 30 and entity in Athens."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Napoleon_Zervas> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Athens> . ?v1 <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the leader of National Party of Greece and entity in the death place, that is a settlement, of Antonios Varthalitis."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v3 . ?v2 <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v2 . ?result <http://dbpedia.org/ontology/place> ?v3 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of 30 and war of the leader of National Party of Greece."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/National_Party_of_Greece> <http://dbpedia.org/property/leader> ?v1 . ?v2 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . ?v1 <http://dbpedia.org/ontology/battle> ?result . ?v2 <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the death place, that is a settlement, of Antonios Varthalitis and war of the awardee of 30."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://dbpedia.org/property/awards> \"30\"^^<http://www.w3.org/2001/XMLSchema#integer> . ?result <http://dbpedia.org/ontology/place> ?v2 . ?v2 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement>. <http://dbpedia.org/resource/Antonios_Varthalitis> <http://dbpedia.org/ontology/deathPlace> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Russian Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Karl Gustav von Baggovut."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Karl_Gustav_von_Baggovut> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Alexander Lvovich Davydov."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Alexander_Lvovich_Davydov> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the birth place of Elena \u017dalinkevi\u010dait\u0117-Petrauskien\u0117."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Elena_\u017dalinkevi\u010dait\u0117-Petrauskien\u0117> <http://dbpedia.org/ontology/birthPlace> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the awardee of 25."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/awards> \"25\"^^<http://www.w3.org/2001/XMLSchema#integer> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the awardee of Golden Sword for Bravery."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Golden_Sword_for_Bravery> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Karl Gustav von Baggovut and entity in Russian Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Karl_Gustav_von_Baggovut> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Alexander Lvovich Davydov and entity in Russian Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . <http://dbpedia.org/resource/Alexander_Lvovich_Davydov> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birth place of Elena \u017dalinkevi\u010dait\u0117-Petrauskien\u0117."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Elena_\u017dalinkevi\u010dait\u0117-Petrauskien\u0117> <http://dbpedia.org/ontology/birthPlace> ?v1 . ?result <http://dbpedia.org/ontology/place> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Karl Gustav von Baggovut and war of Alexander Lvovich Davydov."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Alexander_Lvovich_Davydov> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Karl_Gustav_von_Baggovut> <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of 25."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v0 <http://dbpedia.org/property/awards> \"25\"^^<http://www.w3.org/2001/XMLSchema#integer> . ?v0 <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of Golden Sword for Bravery."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Golden_Sword_for_Bravery> . ?v1 <http://dbpedia.org/ontology/battle> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Alexander Lvovich Davydov and war of Karl Gustav von Baggovut and entity in Russian Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Karl_Gustav_von_Baggovut> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Alexander_Lvovich_Davydov> <http://dbpedia.org/ontology/battle> ?result . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of Karl Gustav von Baggovut and entity in the birth place of Elena \u017dalinkevi\u010dait\u0117-Petrauskien\u0117."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> ?v1 . <http://dbpedia.org/resource/Karl_Gustav_von_Baggovut> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Elena_\u017dalinkevi\u010dait\u0117-Petrauskien\u0117> <http://dbpedia.org/ontology/birthPlace> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Russian Empire and war of the awardee of 25."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/battle> ?result . ?v1 <http://dbpedia.org/property/awards> \"25\"^^<http://www.w3.org/2001/XMLSchema#integer> . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the birth place of Elena \u017dalinkevi\u010dait\u0117-Petrauskien\u0117 and war of Alexander Lvovich Davydov."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/place> ?v1 . <http://dbpedia.org/resource/Alexander_Lvovich_Davydov> <http://dbpedia.org/ontology/battle> ?result . <http://dbpedia.org/resource/Elena_\u017dalinkevi\u010dait\u0117-Petrauskien\u0117> <http://dbpedia.org/ontology/birthPlace> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the war of the awardee of Golden Sword for Bravery and entity in Russian Empire."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v2 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/Golden_Sword_for_Bravery> . ?result <http://dbpedia.org/ontology/place> <http://dbpedia.org/resource/Russian_Empire> . ?v2 <http://dbpedia.org/ontology/battle> ?result . }"}]}
