{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the actor of the movie, that is a work and a film, with Audrey Hepburn and spouse of the awardee of List of awards and nominations received by Janusz Kami\u0144ski."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/starring> ?result . ?v2 <http://dbpedia.org/property/awards> <http://dbpedia.org/resource/List_of_awards_and_nominations_received_by_Janusz_Kami\u0144ski> . ?result <http://dbpedia.org/ontology/spouse> ?v2 . ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Work>. ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film>. ?v1 <http://dbpedia.org/property/starring> \"Audrey Hepburn\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Roy Barreras."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Colombia."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Gustavo Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the person born, that is a politician, as Roy Leonardo Barreras Montealegre?"}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . ?result <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the country of Daniel Elahi Gal\u00e1n."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Who is the father of Sof\u00eda Petro?"}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Colombia and party of Roy Barreras."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Gustavo Petro and party of Roy Barreras."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v1 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Colombia and party of Gustavo Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the country of Daniel Elahi Gal\u00e1n."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v1 . ?result <http://dbpedia.org/ontology/country> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the father of Sof\u00eda Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v1 . ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Colombia and party of Gustavo Petro and party of Roy Barreras."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in Colombia and party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . ?v0 <http://dbpedia.org/ontology/party> ?result . ?v0 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . ?v0 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Roy Barreras and entity in the country of Daniel Elahi Gal\u00e1n."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v2 . <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Gustavo Petro and party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v1 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?v1 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Roy Barreras and party of the father of Sof\u00eda Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v0 . <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . ?v0 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the country of Daniel Elahi Gal\u00e1n and party of Gustavo Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> ?v2 . <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v2 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the father of Sof\u00eda Petro and entity in Colombia."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre and party of Gustavo Petro and entity in Colombia."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v3 <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?v3 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Roy Barreras and entity in the country of Daniel Elahi Gal\u00e1n and party of Gustavo Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { <http://dbpedia.org/resource/Gustavo_Petro> <http://dbpedia.org/ontology/party> ?result . ?result <http://dbpedia.org/ontology/country> ?v1 . <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of Roy Barreras and entity in Colombia and party of the father of Sof\u00eda Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Colombia> . <http://dbpedia.org/resource/Roy_Barreras> <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v1 . ?v1 <http://dbpedia.org/ontology/party> ?result . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the entity in the country of Daniel Elahi Gal\u00e1n and party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v0 . ?v3 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v0 . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v3 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the person born, that is a politician, as Roy Leonardo Barreras Montealegre and party of the father of Sof\u00eda Petro."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?v1 <http://dbpedia.org/ontology/party> ?result . ?v3 <http://dbpedia.org/property/birthName> \"Roy Leonardo Barreras Montealegre\"@en . ?v3 <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician>. ?v3 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v1 . }"}]}
{"messages": [{"role": "system", "content": "Given a natural language question about a specific entity, generate a SPARQL query that retrieves relevant information from DBpedia."}, {"role": "user", "content": "Give me the party of the father of Sof\u00eda Petro and entity in the country of Daniel Elahi Gal\u00e1n."}, {"role": "assistant", "content": "SELECT ?result WHERE { ?result <http://dbpedia.org/ontology/country> ?v2 . <http://dbpedia.org/resource/Sof\u00eda_Petro> <http://dbpedia.org/property/father> ?v1 . ?v1 <http://dbpedia.org/ontology/party> ?result . <http://dbpedia.org/resource/Daniel_Elahi_Gal\u00e1n> <http://dbpedia.org/ontology/country> ?v2 . }"}]}
